#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-API-Dev/runs/run-KyBz6nPxE6kF8QHv

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.weight_targets_insert_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_edit_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refresh complete after 0s [id=fb56b60127d16b98ac3286578cc4850547fba4a2]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_insert_zip: Refresh complete after 0s [id=5b89fea08bcfdac04cbdf0fcf8390ae3c14cf5fe]
module.lambda.data.archive_file.weight_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refresh complete after 0s [id=9f0d18e912544744ea1f7bdb3f0f3389940a275e]
module.lambda.data.archive_file.weight_measurements_edit_zip: Refresh complete after 0s [id=5828616d8c03adb65adef6671a5da4f13f1c8132]
module.lambda.data.archive_file.weight_measurements_insert_zip: Refresh complete after 0s [id=c8dd1211faea11b80406c8795f8bb349caecdfc9]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refresh complete after 0s [id=a499c2464121a247693d1896477f48d313b34ed6]
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refresh complete after 0s [id=3362bcc29ed7cdb8f99044734d23bf8df3868e8e]
module.lambda.data.archive_file.weight_targets_delete_zip: Refresh complete after 0s [id=9d4473f521220ead636da903d0068b57bcfd418c]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_shared_layer_zip: Refresh complete after 0s [id=8328041600003190df194d0acd1debdd7eb60c27]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refresh complete after 0s [id=7c358a38538c799391ead2dc1755227c1d5182da]
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refresh complete after 0s [id=f298a281d43b744419ba3a4751bc4ee1543dc030]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dead-letter-dev]
module.api.aws_api_gateway_rest_api.jowe_api: Refreshing state... [id=gaj1kflz21]
module.lambda.data.aws_iam_policy_document.assume_role: Refreshing...
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-dev]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refreshing...
module.lambda.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-user-data-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_lambda_layer_version.weight_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11]
module.sns_and_sqs.aws_sns_topic.delete_user_data: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev]
module.db.aws_dynamodb_table.jowe_weight_targets: Refreshing state... [id=JoWe-weight-targets-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-retrieve-dev]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refresh complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.lambda.aws_cloudwatch_log_group.weight_measurements_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-retrieve-dev]
module.api.aws_api_gateway_domain_name.custom_domain_name: Refreshing state... [id=jowe-api-dev.initialised.si]
module.lambda.aws_lambda_layer_version.common_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25]
module.lambda.aws_cloudwatch_log_group.weight_measurements_edit_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-edit-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-insert-dev]
module.auth.aws_cognito_user_pool.user_pool: Refreshing state... [id=eu-south-1_lu9o6yXs7]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dead-letter-dev]
module.api.data.aws_iam_policy_document.assume_role: Refreshing...
module.api.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2699642182]
module.db.aws_dynamodb_table.jowe_measurements: Refreshing state... [id=JoWe-weight-measurements-dev]
module.lambda.aws_iam_role.jowe_api_lambda_crud: Refreshing state... [id=JoWe-api-lambda-crud-dev]
module.lambda.aws_iam_role.jowe_api_lambda_read_only: Refreshing state... [id=JoWe-api-lambda-read-only-dev]
module.api.aws_api_gateway_model.weight_targets_insert_request: Refreshing state... [id=3z47ce]
module.api.aws_api_gateway_model.common_error_response: Refreshing state... [id=oybbak]
module.api.aws_api_gateway_request_validator.jowe_api_request_validator: Refreshing state... [id=s8r6jk]
module.api.aws_api_gateway_model.weight_measurments_insert_request: Refreshing state... [id=be8t2d]
module.api.aws_api_gateway_model.weight_measurment_response: Refreshing state... [id=p46fxr]
module.api.aws_api_gateway_model.weight_target_response: Refreshing state... [id=o240xi]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_4XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_4XX]
module.api.aws_api_gateway_model.weight_measurments_response: Refreshing state... [id=ylrkio]
module.api.aws_api_gateway_resource.admin_resource: Refreshing state... [id=ma74g7]
module.api.aws_api_gateway_model.weight_targets_response: Refreshing state... [id=7rivhe]
module.api.aws_api_gateway_resource.weight_resource: Refreshing state... [id=9d506r]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_5XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_5XX]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refreshing...
module.api.aws_iam_role.jowe_api_gateway_sns: Refreshing state... [id=JoWe-api-gateway-sns-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refresh complete after 0s [id=274515956]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_crud_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192625378200000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_read_only_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192625368600000001]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refresh complete after 0s [id=1080394040]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refresh complete after 0s [id=3281627535]
module.sns_and_sqs.aws_iam_policy.sns_delete_user_data_topic_publish_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sns-delete-user-data-topic-publish-policy-dev]
module.api.aws_api_gateway_resource.delete_user_data: Refreshing state... [id=j8n2v2]
module.db.aws_iam_policy.dynamodb_weight_target_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_weight_target_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-read-only-policy-dev]
module.api.aws_api_gateway_resource.weight_targets_resource: Refreshing state... [id=l1qa8q]
module.api.aws_api_gateway_resource.weight_measurements_resource: Refreshing state... [id=5mtizn]
module.api.aws_api_gateway_method.delete_user_data_method_options: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-OPTIONS]
module.api.aws_api_gateway_resource.weight_measurements_id_resource: Refreshing state... [id=4p7ecj]
module.api.aws_api_gateway_method.weight_measurements_method_options: Refreshing state... [id=agm-gaj1kflz21-5mtizn-OPTIONS]
module.api.aws_api_gateway_resource.weight_targets_id_resource: Refreshing state... [id=pu0tuf]
module.api.aws_api_gateway_method.weight_targets_method_options: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-OPTIONS]
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refresh complete after 0s [id=3300638104]
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refresh complete after 0s [id=2947198833]
module.db.aws_iam_policy.dynamodb_measurements_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-read-only-policy-dev]
module.db.aws_iam_policy.dynamodb_measurements_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-crud-policy-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refresh complete after 0s [id=1171862333]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_targets: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:356c500b-0819-4a27-9b3b-c5dff079456c]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_targets_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.sns_and_sqs.aws_iam_policy.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-targets-delete-user-data-queue-policy-dev]
module.api.aws_api_gateway_integration.delete_user_data_integration_options: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-OPTIONS]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=73789kqs6iec23pqcqjsq0ted8]
module.api.aws_api_gateway_integration.weight_measurements_integration_options: Refreshing state... [id=agi-gaj1kflz21-5mtizn-OPTIONS]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637369400000004]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637358700000003]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637373300000006]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637370000000005]
module.api.aws_api_gateway_authorizer.jowe_api_authorizer: Refreshing state... [id=p6bbhi]
module.api.aws_api_gateway_method.weight_measurements_id_method_options: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_id_method_options: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-OPTIONS]
module.api.aws_api_gateway_integration.weight_targets_integration_options: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-OPTIONS]
module.lambda.aws_lambda_function.weight_targets_delete_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-dev]
module.lambda.aws_lambda_function.weight_targets_insert_lambda: Refreshing state... [id=JoWe-api-weight-targets-insert-dev]
module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-measurements-retrieve-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refresh complete after 0s [id=4141459059]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_measurements: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:7a6375cd-e4ce-48b7-85ac-8cc58ef3f811]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_measurements_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.lambda.aws_lambda_function.weight_targets_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-targets-retrieve-dev]
module.lambda.aws_lambda_function.weight_measurements_edit_lambda: Refreshing state... [id=JoWe-api-weight-measurements-edit-dev]
module.lambda.aws_lambda_function.weight_measurements_insert_lambda: Refreshing state... [id=JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_lambda_function.weight_measurements_delete_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-dev]
module.api.aws_api_gateway_method_response.delete_user_data_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-OPTIONS-200]
module.sns_and_sqs.aws_iam_policy.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-measurements-delete-user-data-queue-policy-dev]
module.api.aws_api_gateway_method_response.weight_measurements_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-OPTIONS-200]
module.api.aws_api_gateway_method.weight_targets_method_get: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_method.weight_measurements_id_method_get: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-GET]
module.api.aws_api_gateway_method.weight_measurements_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-DELETE]
module.api.aws_api_gateway_method.weight_measurements_id_method_put: Refreshing state... [id=agm-gaj1kflz21-4p7ecj-PUT]
module.api.aws_api_gateway_method.weight_measurements_method_post: Refreshing state... [id=agm-gaj1kflz21-5mtizn-POST]
module.api.aws_api_gateway_method.weight_targets_id_method_get: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-GET]
module.api.aws_api_gateway_method.weight_targets_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-DELETE]
module.api.aws_api_gateway_method.weight_measurements_method_get: Refreshing state... [id=agm-gaj1kflz21-5mtizn-GET]
module.api.aws_api_gateway_method.weight_targets_method_post: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_method.delete_user_data_method_post: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-POST]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-OPTIONS]
module.api.aws_api_gateway_integration.weight_targets_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-OPTIONS]
module.api.aws_api_gateway_method_response.weight_targets_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-OPTIONS-200]
module.api.aws_api_gateway_integration.delete_user_data_integration_post: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-POST]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_targets_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715349600000007]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_measurements_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715354100000009]
module.api.aws_iam_role_policy_attachment.jowe_api_gateway_sns_delete_user_data_topic_publish_role_attachment: Refreshing state... [id=JoWe-api-gateway-sns-dev-20230725192715350200000008]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-OPTIONS-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-OPTIONS-200]
module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-user-data-dev]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-500]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-500]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-200]
module.lambda.aws_lambda_event_source_mapping.sqs_lambda_event_source_mapping_weight_measurements_delete_user_data: Refreshing state... [id=bca91b62-2f99-4d61-b470-a490d0dbab8e]
module.lambda.aws_lambda_event_source_mapping.sqs_lambda_event_source_mapping_weight_targets_delete_user_data: Refreshing state... [id=fd9dafa7-6d31-48fd-a5f2-3962f33de9dd]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_targets: Refreshing state... [id=terraform-20230725192742660500000013]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_target: Refreshing state... [id=terraform-2023072519274240960000000a]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_measurement: Refreshing state... [id=terraform-20230725192742658500000012]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_measurements: Refreshing state... [id=terraform-2023072519274241200000000d]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_target: Refreshing state... [id=terraform-20230725192742655400000011]
module.api.aws_lambda_permission.gateway_lambda_permission_put_weight_measurement: Refreshing state... [id=terraform-20230809191851589900000001]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_measurement: Refreshing state... [id=terraform-2023072519274241150000000b]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_measurements: Refreshing state... [id=terraform-2023072519274241260000000f]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_target: Refreshing state... [id=terraform-20230725192742652900000010]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_targets: Refreshing state... [id=terraform-2023072519274241160000000c]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_measurements: Refreshing state... [id=terraform-2023072519274241240000000e]
module.api.aws_api_gateway_integration.weight_targets_integration_post: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_integration.weight_targets_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-GET]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-DELETE]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-GET]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_put: Refreshing state... [id=agi-gaj1kflz21-4p7ecj-PUT]
module.api.aws_api_gateway_integration.weight_measurements_integration_get: Refreshing state... [id=agi-gaj1kflz21-5mtizn-GET]
module.api.aws_api_gateway_integration.weight_targets_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-DELETE]
module.api.aws_api_gateway_integration.weight_measurements_integration_post: Refreshing state... [id=agi-gaj1kflz21-5mtizn-POST]
module.api.aws_api_gateway_integration.weight_targets_integration_get: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_method_response.weight_targets_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_method_response.weight_targets_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-PUT-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-PUT-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-400]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-4p7ecj-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_method_response.weight_targets_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-5mtizn-POST-500]
module.api.aws_api_gateway_deployment.jowe_api_deployment: Refreshing state... [id=cq6294]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-PUT-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-PUT-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-5mtizn-POST-500]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-5mtizn-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-400]
module.api.aws_api_gateway_stage.jowe_stage: Refreshing state... [id=ags-gaj1kflz21-dev]
module.api.aws_api_gateway_base_path_mapping.custom_domain_name_stage_mapping: Refreshing state... [id=jowe-api-dev.initialised.si/]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-4p7ecj-GET-500]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.jowe_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "jowe_api_deployment" {
      ~ created_date  = "2023-08-09T20:26:55Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-1:834514932971:gaj1kflz21/" -> (known after apply)
      ~ id            = "cq6294" -> (known after apply)
      ~ invoke_url    = "https://gaj1kflz21.execute-api.eu-south-1.amazonaws.com/" -> (known after apply)
      ~ variables     = { # forces replacement
          - "deployed_at" = "2023-08-09T20:26:54Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_stage.jowe_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "jowe_stage" {
      ~ deployment_id         = "cq6294" -> (known after apply)
        id                    = "ags-gaj1kflz21-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-user-data-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete-user-data"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_edit_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_edit_lambda" {
        id                             = "JoWe-api-weight-measurements-edit-dev"
      ~ last_modified                  = "2023-08-09T20:26:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
      ~ source_code_hash               = "qKhVveAiyH1IIrh3GfhV7AWeocpER05Ani27226gqxc=" -> "nnuUO71XWmtsgnPJWr2ErWW42fJ9RAkUe8VAV9oP+Lc="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-edit"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_insert_lambda" {
        id                             = "JoWe-api-weight-measurements-insert-dev"
      ~ last_modified                  = "2023-08-09T19:18:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
      ~ source_code_hash               = "ueZr+mAKA4LflKpLvxMY5C/hrdwnuYIzy3accoOqh14=" -> "bThDqh8F/gqvWsk0kADrcYWHrI4N0+Hk2Bq3u2+hlFU="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_retrieve_lambda" {
        id                             = "JoWe-api-weight-measurements-retrieve-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-retrieve"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_lambda" {
        id                             = "JoWe-api-weight-targets-delete-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-targets-delete-user-data-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_insert_lambda" {
        id                             = "JoWe-api-weight-targets-insert-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-insert"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_retrieve_lambda" {
        id                             = "JoWe-api-weight-targets-retrieve-dev"
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:25",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11",
        ] -> (known after apply)
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-retrieve"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_layer_version.weight_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "weight_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-07-25T19:26:31.592+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "uz2PVXLK4koBfOiAsQIR5zUgI3qbD/SPQ0nseme34zM=" -> "nS0NWicC9tsxHPdoEM9Y7Q2rK9RrXGg8oeA61uCbF7M=" # forces replacement
      ~ source_code_size            = 1912 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 10 to change, 2 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*